<?php

use Illuminate\Database\Schema\Blueprint;
use Illuminate\Database\Migrations\Migration;

class AlterUpAffiliatesAddCondition extends Migration
{
    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        //
        Schema::table('up_affiliates', function(Blueprint $table)
        {
            $sql = <<<SQL
Alter table `up_affiliates` add `condition_data` text;
Alter table `up_banners` add `condition` text;

UPDATE `up_affiliates` SET `condition_data`='{\"channel\":{\"1\":\"土豆站内-娱乐\",\"10\":\"土豆站内-游戏\",\"100\":\"土豆站内-分享\",\"104\":\"土豆站内-城市\",\"12\":\"土豆站内-商品\",\"14\":\"土豆站内-音乐\",\"15\":\"土豆站内-体育\",\"21\":\"土豆站内-科技\",\"22\":\"土豆站内-电影\",\"23\":\"土豆站内-其他\",\"24\":\"土豆站内-财富\",\"25\":\"土豆站内-成长\",\"26\":\"土豆站内-汽车\",\"27\":\"土豆站内-女性\",\"28\":\"土豆站内-纪录片\",\"29\":\"土豆站内-热点\",\"3\":\"土豆站内-乐活\",\"30\":\"土豆站内-电视剧\",\"31\":\"土豆站内-综艺\",\"32\":\"土豆站内-风尚\",\"33\":\"土豆站内-健康\",\"34\":\"土豆站内-美容\",\"5\":\"土豆站内-搞笑\",\"9\":\"土豆站内-动画\",\"99\":\"土豆站内-原创\",\"9001\":\"优酷站外-资讯\",\"9002\":\"优酷站外-原创\",\"9003\":\"优酷站外-电影\",\"9022\":\"优酷站外-创意视频\",\"9004\":\"优酷站外-电视剧\",\"9005\":\"优酷站外-体育\",\"9006\":\"优酷站外-音乐\",\"9007\":\"优酷站外-游戏\",\"9008\":\"优酷站外-动漫\",\"9009\":\"优酷站外-美女\",\"9010\":\"优酷站外-搞笑\",\"9011\":\"优酷站外-自拍\",\"9023\":\"优酷站外-全频道关键字\",\"9012\":\"优酷站外-广告\",\"9013\":\"优酷站外-生活\",\"9014\":\"优酷站外-汽车\",\"9015\":\"优酷站外-科技\",\"9024\":\"优酷站外-无分类\",\"9025\":\"优酷站外-拍客\",\"9018\":\"优酷站外-时尚\",\"9017\":\"优酷站外-母婴\",\"9026\":\"优酷站外-旅游\",\"9020\":\"优酷站外-教育\",\"9019\":\"优酷站外-娱乐\",\"9021\":\"优酷站外-综艺\",\"9027\":\"优酷站外-纪录片\",\"9028\":\"优酷站外-微电影\",\"9029\":\"优酷站外-网剧\",\"9016\":\"优酷站外-其他\",\"9030\":\"优酷站外-自拍\",\"9031\":\"优酷站外-自制栏目\",\"9096\":\"优酷站外-汽车之家\",\"9097\":\"优酷站外-搜狐\",\"9098\":\"优酷站外-新浪\",\"9099\":\"优酷站外-开心网\",\"9100\":\"优酷站外-YOKA\",\"a\":\"优酷站内-资讯\",\"b\":\"优酷站内-原创\",\"c\":\"优酷站内-电影\",\"chyi\":\"优酷站内-创意视频\",\"d\":\"优酷站内-电视剧\",\"e\":\"优酷站内-体育\",\"f\":\"优酷站内-音乐\",\"g\":\"优酷站内-游戏\",\"h\":\"优酷站内-动漫\",\"i\":\"优酷站内-女性\",\"j\":\"优酷站内-搞笑\",\"k\":\"优酷站内-自拍\",\"key\":\"优酷站内-全频道关键字\",\"l\":\"优酷站内-广告\",\"m\":\"优酷站内-生活\",\"n\":\"优酷站内-汽车\",\"o\":\"优酷站内-科技\",\"p\":\"优酷站内-无分类\",\"pker\":\"优酷站内-拍客\",\"q\":\"优酷站内-时尚\",\"r\":\"优酷站内-母婴\",\"s\":\"优酷站内-旅游\",\"t\":\"优酷站内-教育\",\"u\":\"优酷站内-娱乐\",\"v\":\"优酷站内-综艺\",\"w\":\"优酷站内-纪录片\",\"wdyg\":\"优酷站内-微电影\",\"wgju\":\"优酷站内-网剧\",\"z\":\"优酷站内-其他\",\"zpai\":\"优酷站内-自拍\",\"zzhi\":\"优酷站内-自制栏目\",\"10000\":\"土豆站外-娱乐\",\"10004\":\"土豆站外-游戏\",\"10022\":\"土豆站外-分享\",\"10023\":\"土豆站外-城市\",\"10005\":\"土豆站外-商品\",\"10006\":\"土豆站外-音乐\",\"10007\":\"土豆站外-体育\",\"10008\":\"土豆站外-科技\",\"10009\":\"土豆站外-电影\",\"10010\":\"土豆站外-其他\",\"10011\":\"土豆站外-财富\",\"10012\":\"土豆站外-成长\",\"10013\":\"土豆站外-汽车\",\"10014\":\"土豆站外-女性\",\"10024\":\"土豆站外-纪录片\",\"10015\":\"土豆站外-热点\",\"10001\":\"土豆站外-乐活\",\"10016\":\"土豆站外-电视剧\",\"10017\":\"土豆站外-综艺\",\"10018\":\"土豆站外-风尚\",\"10020\":\"土豆站外-健康\",\"10019\":\"土豆站外-美容\",\"10002\":\"土豆站外-搞笑\",\"10003\":\"土豆站外-动画\",\"10021\":\"土豆站外-原创\"}}' WHERE (`affiliateid`='108');

SQL;
            DB::connection()->getPdo()->exec($sql);
        });
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        //
        Schema::table('up_affiliates', function (Blueprint $table) {
            $table->dropColumn('income_amount');
        });
    }
}
